FlightAPI_UFT/Log/vtd_user.log

2024-04-25 23:03:39,748 [1] INFO  - Loaded appender: FileAppenderInternal
2024-04-25 23:03:39,753 [1] INFO  - Loaded appender: FileAppenderExternal
2024-04-25 23:03:39,753 [1] INFO  - Loaded appender: UserLoggerAppender
2024-04-25 23:03:39,753 [1] INFO  - Loaded appender: FileAppenderInternal
2024-04-25 23:03:39,754 [1] INFO  - Loaded appender: FileAppenderExternal
2024-04-25 23:03:39,754 [1] INFO  - Loaded appender: UserLoggerAppender
2024-04-25 23:03:39,998 [17] INFO  - Step 'Start' : Step 'Start' started
2024-04-25 23:03:40,021 [17] INFO  - Step 'Start' ended successfully
2024-04-25 23:03:40,023 [17] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2024-04-25 23:03:40,025 [17] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2024-04-25 23:03:40,026 [17] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2024-04-25 23:03:40,034 [17] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>Business</Class>
        <CustomerName>John Smith</CustomerName>
        <DepartureDate>2033-06-01T06:00:00+00:00</DepartureDate>
        <FlightNumber>12430</FlightNumber>
        <NumberOfTickets>1</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2024-04-25 23:03:40,049 [17] INFO  - URL: http://localhost:8000/Flights_SOAP
2024-04-25 23:03:40,082 [17] INFO  - Returning the response to the previous channel
2024-04-25 23:03:40,085 [17] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>192</OrderNumber>
        <TotalPrice>306.8</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2024-04-25 23:03:40,099 [17] INFO  - Structural Validation: True
2024-04-25 23:03:40,107 [17] INFO  - Step 'CreateFlightOrder' ended successfully
2024-04-25 23:03:40,108 [17] INFO  - Step 'DeleteFlightOrder' : Step 'DeleteFlightOrder' started
2024-04-25 23:03:40,110 [17] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <DeleteFlightOrder xmlns="HP.SOAQ.SampleApp">
      <OrderNumber>192</OrderNumber>
    </DeleteFlightOrder>
  </Body>
</Envelope>

2024-04-25 23:03:40,112 [17] INFO  - URL: http://localhost:8000/Flights_SOAP
2024-04-25 23:03:40,121 [17] INFO  - Returning the response to the previous channel
2024-04-25 23:03:40,122 [17] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeleteFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <DeleteFlightOrderResult>true</DeleteFlightOrderResult>
    </DeleteFlightOrderResponse>
  </s:Body>
</s:Envelope>

2024-04-25 23:03:40,125 [17] INFO  - Structural Validation: True
2024-04-25 23:03:40,127 [17] INFO  - Step 'DeleteFlightOrder' ended successfully
2024-04-25 23:03:40,128 [17] INFO  - Step 'Iteration 1' ended successfully
2024-04-25 23:03:40,129 [17] INFO  - Step 'Test Flow' ended successfully
2024-04-25 23:03:40,131 [17] INFO  - Step 'End' : Step 'End' started
2024-04-25 23:03:40,136 [17] INFO  - Step 'End' ended successfully
